In [2]:
import pandas as pd
import numpy as np

df=pd.DataFrame(np.random.randn(5,4), index=['A','B','C','D','E'], columns=['One','Two','Three','Four'])

In [3]:
df.head()

        One       Two     Three      Four
A  0.431070 -0.635331  0.650374  0.875642
B -0.824965  0.120297 -0.790363  1.367665
C  0.045511 -0.049755  0.366123 -0.456076
D -1.084582 -0.267487  0.548181 -0.395041
E -0.524433  1.646633  0.745260 -0.200980

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   One     5 non-null      float64
 1   Two     5 non-null      float64
 2   Three   5 non-null      float64
 3   Four    5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [5]:
df.shape

(5, 4)

In [9]:
df.describe()

            One       Two     Three      Four
count  5.000000  5.000000  5.000000  5.000000
mean  -0.391480  0.162871  0.303915  0.238242
std    0.623203  0.876200  0.627654  0.830349
min   -1.084582 -0.635331 -0.790363 -0.456076
25%   -0.824965 -0.267487  0.366123 -0.395041
50%   -0.524433 -0.049755  0.548181 -0.200980
75%    0.045511  0.120297  0.650374  0.875642
max    0.431070  1.646633  0.745260  1.367665

In [8]:
df.value_counts()

One        Two        Three      Four
-1.084582  -0.267487   0.548181  -0.395041    1
-0.824965   0.120297  -0.790363   1.367665    1
-0.524433   1.646633   0.745260  -0.200980    1
 0.045511  -0.049755   0.366123  -0.456076    1
 0.431070  -0.635331   0.650374   0.875642    1
dtype: int64

In [10]:
df.corr()

           One       Two     Three      Four
One    1.00000 -0.288440  0.356980  0.110450
Two   -0.28844  1.000000  0.139352 -0.270905
Three  0.35698  0.139352  1.000000 -0.674825
Four   0.11045 -0.270905 -0.674825  1.000000

In [14]:
df.tail()

        One       Two     Three      Four
A  0.431070 -0.635331  0.650374  0.875642
B -0.824965  0.120297 -0.790363  1.367665
C  0.045511 -0.049755  0.366123 -0.456076
D -1.084582 -0.267487  0.548181 -0.395041
E -0.524433  1.646633  0.745260 -0.200980